_Tb_cfg_union_official = {
[1] = { '盟主','可招收成员、移除同盟中任意玩家，任命或撤销同盟中的官员，可以禅让盟主和任命副盟主', },
[2] = { '副盟主','可招收成员、移除同盟中的普通成员，放弃自己副盟主的职位', },
[3] = { '官员','可以发送同盟邮件，退出同盟时自动解除官职', },
[4] = { '林掾史','登陆后可使本同盟全部成员获得一定量的木材，自己获得1.5倍，每天生效一次', },
[5] = { '石坊令','登陆后可使本同盟全部成员获得一定量的石头，自己获得1.5倍，每天生效一次', },
[6] = { '武库史','登陆后可使本同盟全部成员获得一定量的铁块，自己获得1.5倍，每天生效一次', },
[7] = { '籍田令','登陆后可使本同盟全部成员获得一定量的粮食，自己获得1.5倍，每天生效一次', },
[8] = { '监市吏','登陆后可使本同盟全部成员获得一定量的钱，自己获得1.5倍，每天生效一次', },
[9] = { '黄门中丞','登陆后可使自己一定机率获得预设奖励1，每天生效一次', },
[10] = { '西园廷卫','登陆后可使自己一定机率获得预设奖励2，每天生效一次', },
[11] = { '兵曹','登陆后可使自己一定机率获得预设奖励3，每天生效一次', },
[12] = { '祭酒','登陆后可使自己一定机率获得预设奖励4，每天生效一次', },
}
local function convertFunc( key, arr )
	return {official_id=key,official_name=arr[1],official_description=arr[2],}
end
Tb_cfg_union_official = {_src_tb_=_Tb_cfg_union_official,_tb_convert_func_=convertFunc}
setmetatable(Tb_cfg_union_official,_tb_cfg_mt_)
