_Tb_cfg_exercise = {
[1] = { '自由演武 简单','敌军Lv.12-15',1,1,95,4,'1,0;',1,2,0,0,'', },
[2] = { '自由演武 普通','敌军Lv.20-25',2,1,95,4,'1,0;',1,3,0,0,'', },
[3] = { '自由演武 困难','敌军Lv.28-36',3,1,95,4,'1,0;',1,4,0,0,'', },
[4] = { '自由演武 极难','敌军Lv.39-50',4,1,95,4,'1,0;',1,0,0,0,'', },
[11] = { '教学演武 I','',0,0,95,4,'1,0;',0,12,0,0,'', },
[12] = { '教学演武 II','',0,0,95,3,'1,0;',0,13,0,0,'步兵攻击骑兵时所造成的伤害下降30%', },
[13] = { '教学演武 III','',0,0,95,3,'1,0;',0,14,0,0,'骑兵攻击弓兵时所造成的伤害下降15%', },
[14] = { '教学演武 IV','',0,0,95,3,'1,0;',0,15,28800,1,'弓兵攻击步兵时所造成的伤害下降30%', },
[15] = { '教学演武 V','',0,0,95,4,'1,0;',0,16,0,0,'武将攻击距离内有敌方目标，才能发动普通攻击，相邻武将距离=1', },
[16] = { '教学演武 VI','',0,0,95,4,'1,0;',0,17,0,0,'攻击高的武将发动攻击伤害较高', },
[17] = { '教学演武 VII','',0,0,95,2,'1,0;',0,18,0,0,'“受谋略影响”的战法的实际效果与谋略有关，谋略越高，效果越强', },
[18] = { '教学演武 VIII','',0,0,95,3,'1,0;',0,19,28800,1,'根据敌方部队的情况，我方可选择优势部队逐一战胜', },
[19] = { '教学演武 IX','',0,0,95,3,'1,0;',0,20,0,0,'防御属性可以下降受到攻击时的伤害', },
[20] = { '教学演武 X','',0,0,95,4,'1,0;',0,1,0,1,'战斗胜利后可以发动攻城，步兵的攻城最高', },
}
local function convertFunc( key, arr )
	return {exercise_id=key,exercise_name=arr[1],exercise_desc=arr[2],exercise_level=arr[3],exercise_cost=arr[4],army_cost=arr[5],born_coordinate=arr[6],win_condition=arr[7],exercise_type=arr[8],next_exercise_id=arr[9],next_cd_time=arr[10],special_reward=arr[11],exercise_tips=arr[12],}
end
Tb_cfg_exercise = {_src_tb_=_Tb_cfg_exercise,_tb_convert_func_=convertFunc}
setmetatable(Tb_cfg_exercise,_tb_cfg_mt_)
