------------------------------------------------------------------
-----------------------随机名字-----------------------------------
------------------------------------------------------------------
PLAYER_FAMILY_NAME = {
"歙郡","赞皇","薛郡","燕郡","鄹邑","虢郡","黎城","鄴郡","漕邑","谯郡","谯国","管城","蔡州","嘉城","溧阳","滇池","新蔡","新淦","新城","新丰","新山","蜀郡","槐里","楚郡","蒙城","蓝田","瑕丘","渭阳","颍阳","鲁国","番阳","舒城","朝歌","博陵","博平","淄川","梁郡","梁国","淮阴","淮阳","涿郡","商于","商山","章武","象郡","崇仁","略阳","堂邑","营州","营丘","舂陵","牂牁","浚阳","浚仪","海陵","海南","朔方","高堂","高要","高昌","高平","余杭","殷阳","钱塘","真腊","顿丘","桂林","晋陵","晋昌","莱阳","盐官","绛郡","宣城","宣平","浔阳","洛宁","洹水","临安","临湘","临济","临邛","括苍","括阳","咸阳","栎阳","相城","荆南","荆州","南越","南康","南陵","南宫","南国","南昌","荥阳","赵郡","始兴","始平","陕郡","建康","房陵","宛丘","郓城","河朔","河南","河西","河中","金源","金山","郃阳","昆明","松阳","苑川","武溪","武昌","武邑","武成","武阳","武汉","武川","青州","邵阳","陈郡","宋城","沛郡","沛国","汶阳","汾阳","汧阳","怀道","怀远","吴郡","吴兴","邺郡","抚州","杜陵","严陵","寿昌","观津","阴山","阳河","阳阿","寻阳","安陵","安陆","安邑","安西","安阳","安东","汲郡","汝阳","汝宁","兴元","江都","关西","齐安","齐郡","后江","华阳","延陵","延安","曲阜","曲沃","曲成","扬州","成阳","百济","圯桥","辽海","永嘉","永城","永兴","永宁","永乐","永平","汉阳","汉东","汉平","外黄","句章","白水","仪真","代北","代郡","北平","东鲁","东越","东郓","东吴","东阳","平襄","平陵","平城","平昌","平阴","平安","平卢","龙阳","龙城","石城","玉田","巴郡","巴南","方城","六安","凤阳","仇池","长葛","长乐","内黄","历阳","太康","五溪","五台","云阳","天竺","天台","马岭","卫国","义阳","广德","千乘","山西","山东","上郡","上邽","大梁","大兴","三原","九江","黎阳","襄国","石邑","壶关","马邑","灵丘","界桥","徐无","肥如","馆陶","广宗","高唐","新昌","宾徒","高密","菖县","蒙阴","松江","武进","准安","皖县","曲江","乌林","醴陵","赤壁","夏口","始安","汉兴","重安","白帝","油江","中阳","离石","汪陶","博望","郿县","邦县","盱眙","威县","都阳","下卞","陇右","葭萌","街亭","鶥坞","官渡","乌巢","泰安","高苑","延津","虎牢","潼关","端溪","临武","昭陵","夫夷","琅琊","镡威","南平","秭归","长坂","新野","华容","竟陵","宛县","穰县","夷陵","南阳","南郡","江陵","襄阳","海阳","犷平","潞县","泉州","涿县","涿鹿","容城","辽阳","雍奴","昌平","居庸","襄平","代县","昆泽","樊道","沔阳","绵竹","剑阁","江州","南中","南充","南郑","成都","山丹","令居","允街","玉门","氐池","安夷","枝阳","苍松","屋兰","临羌","祖厉","宣威","昭武","嘉峪关","姑臧","上艾","邬县","大陵","榆次","孟县","陭氏","高都","阳曲","定襄","剧阳","屯留","中都","阳邑","九原","楼烦","泫氏","晋阳","泾县","犁阳","阳泉","安吴","海盐","龙川","山阴","歙县","宜春","陵阳","嘉兴","句容","薪春","柴桑","建业","海西","夏丘","梧县","既丘","临驹","合城","小沛","高邮","曲阳","凌县","兰陵","东安","博阳","开阳","临沂","漯阴","郡昌","观阳","黄县","东朝阳","博昌","夷安","东牟","胶东","昌安","营陵","历城","平寿","即墨","广固","临淄","聊城","高阳","紫阳","中丘","灵寿","望都","邯郸","上曲阳","武垣","真定","信都","卢奴","魏郡","渤海","南皮","下蔡","朗思","汝阴","阳夏","长平","舞阳","虞县","曲阿","新阳","定陵","襄城","睢阳","沛县","昆阳","颍川","寿春","许昌","雍丘","封丘","句阳","樊县","巨平","嬴县","卢县","巨野","梁甫","东阿","范县","白马","济阳","昌邑","鲁郡","南武阳","南平阳","定陶","鄄城","濮阳","东郡","廪丘","池阳","陈仓","上庸","高陆","祁山","五丈原","成纪","狄道","夏阳","上洛","武功","长安","京县","襄陵","新安","华阴","中牟","密县","临汾","宜阳","阳翟","开封","阳武","苑林","永安","偃师","新郑","平阳","洛阳","梓潼","朱崖","朱提","中山","长沙","张掖","云南","越隽","豫章","郁林","渔阳","右北平","永昌","颖川","阴平","弋阳","宜都","徉柯","阳平","雁门","玄菟","兴古","新兴","新平","新都","湘东","下邳","西平","西河","西海","武威","武陵","武都","汶山","天水","泰山","太原","上谷","上党","山阳","汝南","日南","任城","清河","蕲春","鄱阳","平原","毗陵","彭城","南海","南安","庐陵","庐江","陇西","零陵","临贺","临海","临川","辽西","辽东","乐平","乐陵","乐浪","乐安","琅邪","巨鹿","酒泉","九真","京兆","金城","交趾","江阳","江夏","建平","建宁","建安","犍为","济阴","济南","济北","会稽","淮南","弘农","衡阳","河内","河南尹","河间","河东","合浦","汉中","汉嘉","桂阳","广魏","广平","广陵","广汉","高凉","涪陵","扶风","冯翊","范阳","敦煌","东平","东莱","东海","东广汉","丹阳","带方","城阳","陈留","常山","昌黎","苍梧","勃海","北海","北地","巴西","巴东","安平","安丰","安定",
}



PLAYER_FIRST_NAME = {
"白耳兵","北府兵","飞军","敢死军","虎豹骑","虎步军","虎士军","解烦兵","马闲军","目毛军","青巾军","青羌军","散骑","射声军","神行军","十二卫","十九骑","十三骑","十一骑","突将军","屯骑","无当军","无难军","无前军","武骑","武射军","武卫军","先登兵","陷阵营","骁骑军","夷兵","义从军","义士军","游击军","越骑","长水军","中坚军","中垒军","重步","虎卫军","甲兵","铁鹰军","技击兵","武卒军","死士","击刹军","千人队","北府军","重战车","忠孝军","玄甲军","乞活军","白马军","霸王军","魏武卒","铁浮屠","虎贲军","山阵军","大戟士","丹阳兵","青州兵","羽林军","右骁卫","左骁卫","骁果卫","十二卫","十九步","十三步","十一步","十五步","十七步","十五骑","十七骑","白袍军","十八骑","十八步","背嵬军","突骑","白杆兵","十九弓","十三弓","十一弓","十五弓","十七弓","新军","神机营","轻弩兵","重弩兵","斥候","锐士","带甲","胡骑军","南军","北军","劫营骑",
}













