_Tb_cfg_region = {
[1] = { '司隶','司隶','光武定国，以为东都，两川交汇，雄关据险，关中腹地易守难攻，乃帝业之中心。\n首府：洛阳',0, },
[2] = { '雍州','雍','关中以西，枕千山，面渭水，始皇霸图之启，凤鸣于歧而翔于雍，名之谓“雍”。\n首府：长安',0, },
[3] = { '兖州','兖','济河之间，优土质原，旧遗孔孟良风，其人尚儒好学，性直怀义，故封之曰“兖”。\n首府：廪丘',0, },
[4] = { '豫州','豫','河之南，汉之北，周王治世，中州重地，水道纵横，陌道连通，山无险阻，兵家必争。\n首府：谯',0, },
[5] = { '冀州','冀','夏天子，东近瀛海，南临河济，川原绕衍，控带燕齐，土平兵强，英杰所利，为南北要冲，戎马之场。\n首府：邺',1, },
[6] = { '青州','青','禹王岁止，阔土东夷，泰山麓北，齐侯故地，五行属木而色青，海岱惟青州。\n首府：临淄',1, },
[7] = { '徐州','徐','济右之地，淮、沂其乂，蒙、羽其艺，赤土成壤，羽畎夏翟，临珠暨渔，是为“徐”。\n首府：彭城',1, },
[8] = { '扬州','扬','吴越兵烽归一，跨大江，涵太湖，水道如织，雨沛粮足，虽多矮山而易居，山越南傍，沿于海而达至淮泗。\n首府：建业',1, },
[9] = { '并州','并','中原之北，南北纵列山峦，天燥少雨，凛冬时久致生计不易，地广人稀，又于两谷之间，曰“并”。\n首府：太原',1, },
[10] = { '凉州','凉','汉武骠骑西驰，通一线于广漠，秦川中，黄沙背，胡汉相接，兵商混杂，朔风起，铁马踏。\n首府：武威',1, },
[11] = { '益州','益','西南隅所，地险山峻，道成天堑拒敌于不入，偶有南蛮芥癣，沃野千里，风雨调顺，锦官城外，蓉花胜海。\n首府：成都',1, },
[12] = { '幽州','幽','极北治所，舳舻循水而至，丽鲜之民，闻汉风居，散关下，通贾如织而岁末不止。\n首府：蓟',1, },
[13] = { '荆州','荆','荆襄重地，北望中原，据吴州、扼蜀川，陆水通达，纳九郡、归三江，民富足，王道之基。\n首府：襄阳',1, },
}
local function convertFunc( key, arr )
	return {region_id=key,name=arr[1],show_name=arr[2],description=arr[3],born=arr[4],}
end
Tb_cfg_region = {_src_tb_=_Tb_cfg_region,_tb_convert_func_=convertFunc}
setmetatable(Tb_cfg_region,_tb_cfg_mt_)
