_Tb_cfg_progress = {
[1] = { '黄巾之乱','汉末，黄巾军起，将星举旗，天下兵乱，至此而始\n【目标】：全地图120000格土地被占领','汉末，黄巾军起，将星举旗，天下兵乱，至此而始\n【目标】：全地图120000格土地被占领','太平道灭，黄天焰熄，遗祸于民，盗匪未止',0,2,'1,1,120000',172800,'1,1,0,0;2,901,0,0;',1,'99,200;','','1,1,0,0;2,1,0,0;3,1,5,86400;','','',2, },
[2] = { '汉室衰微','朝纲败乱，皇路渐没，奈何大厦将倾，朽木不支，神州难掌，仲室危矣\n【目标】：全服剿灭贼兵数量7500000','朝纲败乱，皇路渐没，奈何大厦将倾，朽木不支，神州难掌，仲室危矣\n【目标】：全服剿灭贼兵数量7500000','诸侯以大小百战，聚兵求将，各据一方，欲逐其鹿',0,3,'6,0,7500000',172800,'2,902,0,0;',1,'99,200;','','1,1,0,0;2,1,0,0;3,1,5,86400;','','',3, },
[3] = { '天下大乱','太师乱京，掌稷代责，然人心无所向，各方势力，或应天时、或从私欲，将分食于中原\n【目标】：人数超过20人数的同盟数量达到75个','太师乱京，掌稷代责，然人心无所向，各方势力，或应天时、或从私欲，将分食于中原\n【目标】：人数超过20人数的同盟数量达到75个','古城火起，西京倾覆，庙堂中无人可控，乱世之象，豪雄纷绽而立',0,4,'7,0,75',172800,'2,903,0,0;7,801,8,0;7,0,8,0;1,2,0,0;',1,'99,200;','','1,1,0,0;2,1,0,0;3,1,5,86400;','','',1, },
[4] = { '厉兵秣马','举旗立势，内积外侵，揽富庶之地，攻兵要之城，蓄积后发，图谋大事\n【目标】：全地图15000格 4级以上土地被占领','举旗立势，内积外侵，揽富庶之地，攻兵要之城，蓄积后发，图谋大事\n【目标】：全地图15000格 4级以上土地被占领','安治所，兴金铁，收流民，扩军力，兵锋隔界互望，划地而峙',0,5,'1,4,15000',259200,'2,904,0,0;',1,'99,200;','','1,1,0,0;2,1,0,0;3,1,5,86400;','','',2, },
[5] = { '群雄割据','关中富庶，蜀川沃野，凉武驱驰，青徐合纵，荆水襄田，淮扬天埑，神州多锦秀，英雄岂曾落后？\n【目标】：全地图20个3级或以上城池被占领','关中富庶，蜀川沃野，凉武驱驰，青徐合纵，荆水襄田，淮扬天埑，神州多锦秀，英雄岂曾落后？\n【目标】：全地图20个3级或以上城池被占领','金城内外，无不兴兵；夷野南北，莫息干戈，云起烽烟，皆阵于席',0,6,'5,1,20',604800,'2,904,0,0;7,801,12,0;7,0,12,0;1,3,0,0;',1,'99,300;','','1,1,0,0;2,1,0,0;3,1,5,86400;','','',4, },
[6] = { '十八路诸侯','古语云：兼弱攻昧，强取弱食，既无一治，何言非我？列金铁，扬戟兵，将所望，千里之遥\n【目标】：18路同盟角逐势力值积分','古语云：兼弱攻昧，强取弱食，既无一治，何言非我？列金铁，扬戟兵，将所望，千里之遥\n【目标】：18路同盟角逐势力值积分\n【奖励】：第1名全盟1000玉符，第2~3名全盟600玉符，第4~18名，全盟200玉符','互伐之战，岁末未止，远交进攻，取邻于己，固一方之基，惟立不败',0,7,'16,2,18',864000,'7,801,20,0;7,0,20,0;6,150,0,0;',2,'99,200;','1,500;3,300;18,100;','1,3,0,0;2,3,0,0;3,3,5,86400;','','',1, },
[7] = { '三国鼎立','一州之地，水长道续，城分十等，星列如棋，州城均占，寸土亦争，事无俱细，统合归并，方成一国\n【目标】：三个州首府被占领','一州之地，水长道续，城分十等，星列如棋，州城均占，寸土亦争，事无俱细，统合归并，方成一国\n【目标】：三个州首府被占领','善君者，必文武并举，恩齐威至，州府既定，当进击要隘，夺敌之先',0,8,'4,0,3',864000,'',2,'99,300;','','1,4,0,0;2,4,0,0;3,4,5,172800;','','',4, },
[8] = { '入主中原','雍、兖、豫数州，叶衬东都，据其关道，各司一方，欲成帝业，必取之\n【目标】：任意一个雍、兖、豫州的首府被占领','雍、兖、豫数州，叶衬东都，据其关道，各司一方，欲成帝业，必取之\n【目标】：任意一个雍、兖、豫州的首府被占领','先机已占，优势将显，应再拓疆域，直指关中，如此，霸图可期',0,9,'13,0,1',864000,'1,4,0,0;',2,'99,400;','','1,4,0,0;2,4,0,0;3,4,5,172800;','','',4, },
[9] = { '席卷天下','崤函帝苑，河雒皇庭，四方入贡，百疆齐叩，登神州之中、揽天下之胜，国都在前，惟我可取！\n【目标】：国都洛阳被占领','崤函帝苑，河雒皇庭，四方入贡，百疆齐叩，登神州之中、揽天下之胜，国都在前，惟我可取！\n【目标】：国都洛阳被占领','九帝十朝，西起东兴，现帝星再临，诸州方圆，皆所欲也',0,10,'12,0,1',0,'',2,'99,400;','','1,4,0,0;2,4,0,0;3,4,5,172800;','','',4, },
[10] = { '三分归一','普天之下，莫非王土，率土之滨，莫非王臣，乾坤未清，余势尚存，望帝星奋勇，复起皇庭\n【目标】：全部13州首府被同一个同盟占领','普天之下，莫非王土，率土之滨，莫非王臣，乾坤未清，余势尚存，望帝星奋勇，复起皇庭\n【目标】：全部13州首府被同一个同盟占领','足踏山河，掌抚天穹，戚止战休，乱世将终，帝星之功，传世永颂！',0,0,'15,0,1',0,'',2,'99,500;','','1,4,0,0;2,4,0,0;3,4,5,432000;','【天下一统】','恭喜全服达成“三分归一”进度，全国获得统一！',4, },
[101] = { '占领首府','【目标】：首府被占领','【目标】：首府被占领','',1,0,'10,0,1',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,172800;','','',4, },
[102] = { '占领5级土地I','【目标】：全州5级土地以上占领百分比5%','【目标】：全州5级土地以上占领百分比5%','',1,0,'2,5,5',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',2, },
[103] = { '占领5级土地II','【目标】：全州5级土地以上占领百分比20%','【目标】：全州5级土地以上占领百分比20%','',1,0,'2,5,20',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',2, },
[104] = { '占领5级土地III','【目标】：全州5级土地以上占领百分比50%','【目标】：全州5级土地以上占领百分比50%','',1,0,'2,5,50',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',2, },
[105] = { '占领6级土地','【目标】：全州6级土地以上占领百分比20%','【目标】：全州6级土地以上占领百分比20%','',1,0,'2,6,20',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',2, },
[106] = { '占领7级土地','【目标】：全州7级土地以上占领百分比20%','【目标】：全州7级土地以上占领百分比20%','',1,0,'2,7,20',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',2, },
[107] = { '占领8级土地','【目标】：全州8级土地以上占领百分比20%','【目标】：全州8级土地以上占领百分比20%','',1,0,'2,8,20',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',2, },
[108] = { '占领9级土地','【目标】：全州9级土地以上占领百分比20%','【目标】：全州9级土地以上占领百分比20%','',1,0,'2,9,20',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',2, },
[109] = { '占领城池I','【目标】：城市占领数量达到5','【目标】：城市占领数量达到5','',1,0,'5,1,5',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',4, },
[110] = { '占领城池II','【目标】：城市占领数量达到10','【目标】：城市占领数量达到10','',1,0,'5,1,10',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',4, },
[111] = { '占领城池III','【目标】：城市占领数量达到15','【目标】：城市占领数量达到15','',1,0,'5,1,15',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,86400;','','',4, },
[112] = { '占领全部城池','【目标】：占领本州全部城市','【目标】：占领本州全部城市','',1,0,'11,0,0',0,'',0,'','','1,2,0,0;2,2,0,0;3,2,5,259200;','','',4, },
}
local function convertFunc( key, arr )
	return {id=key,name=arr[1],desc=arr[2],detail_desc=arr[3],result_desc=arr[4],progress_type=arr[5],next_progress=arr[6],condition=arr[7],valid_time=arr[8],action=arr[9],reward_type=arr[10],reward=arr[11],reward_ratio=arr[12],notice=arr[13],mail_title=arr[14],mail_detail=arr[15],bg_res_type=arr[16],}
end
Tb_cfg_progress = {_src_tb_=_Tb_cfg_progress,_tb_convert_func_=convertFunc}
setmetatable(Tb_cfg_progress,_tb_cfg_mt_)
